gdgly/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	return (char*)TCFG_SystemData.WorkModeStr;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarCount(unsigned int val)
 @Description			TCFG_EEPROM_SetRadarCount					: 保存RadarCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarCount(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_RADARCOUNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetRadarCount(void)
 @Description			TCFG_EEPROM_GetRadarCount					: 读取RadarCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetRadarCount(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_RADARCOUNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_AddRadarCount(void)
 @Description			TCFG_AddRadarCount							: RadarCount++
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_AddRadarCount(void)
{
	TCFG_SystemData.RadarCount++;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_GetRadarCount(void)
 @Description			TCFG_GetRadarCount							: 获取RadarCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_GetRadarCount(void)
{
	return TCFG_SystemData.RadarCount;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarDbgMode(unsigned char val)
 @Description			TCFG_EEPROM_SetRadarDbgMode					: 保存RadarDbgMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarDbgMode(unsigned char val)
{
	if (val > 8) val = 0;
	else val = 8 - val;
	FLASH_EEPROM_WriteByte(TCFG_RADARDBG_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRadarDbgMode(void)
 @Description			TCFG_EEPROM_GetRadarDbgMode					: 读取RadarDbgMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRadarDbgMode(void)
{
	unsigned char val8;
	
	val8 = FLASH_EEPROM_ReadByte(TCFG_RADARDBG_OFFSET);
	if (val8 > 8) return 0;
	else val8 = 8 - val8;
	
	return val8;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetStatusCount(unsigned int val)
 @Description			TCFG_EEPROM_SetStatusCount					: 保存StatusCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetStatusCount(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_STATUSCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetStatusCount(void)
 @Description			TCFG_EEPROM_GetStatusCount					: 读取StatusCount
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetStatusCount(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_STATUSCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRfChannel(unsigned char val)
 @Description			TCFG_EEPROM_SetRfChannel						: 保存RfChannel
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRfChannel(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RFCHANNEL_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRfChannel(void)
 @Description			TCFG_EEPROM_GetRfChannel						: 读取RfChannel
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRfChannel(void)
{
	unsigned char val;
	
	val = FLASH_EEPROM_ReadByte(TCFG_RFCHANNEL_OFFSET);
	switch (val)
	{
	case 36:
		val = 36;
		break;
	case 4:
		val = 4;
		break;
	case 6:
		val = 6;
		break;
	case 16:
		val = 16;
		break;
	case 26:
		val = 26;
		break;
	default:
		val = 36;
		break;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRFDprintLv(uint8_t val)
 @Description			TCFG_EEPROM_SetRFDprintLv					: 保存RFDprintLv
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRFDprintLv(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RF_DPRINT_LV_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRFDprintLv(void)
 @Description			TCFG_EEPROM_GetRFDprintLv					: 读取RFDprintLv
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRFDprintLv(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RF_DPRINT_LV_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetEnableNBiotPSM(unsigned char val)
 @Description			TCFG_EEPROM_SetEnableNBiotPSM					: 保存EnableNBiotPSM
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetEnableNBiotPSM(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_ENABLE_NBIOTPSM_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetEnableNBiotPSM(void)
 @Description			TCFG_EEPROM_GetEnableNBiotPSM					: 读取EnableNBiotPSM
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetEnableNBiotPSM(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_ENABLE_NBIOTPSM_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetActiveDeice(unsigned char val)
 @Description			TCFG_EEPROM_SetActiveDeice					: 保存ActiveDeice
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetActiveDevice(unsigned char val)
{
	if (val) val = 0;
	else val = 1;
	FLASH_EEPROM_WriteByte(TCFG_ACTIVE_DEVICE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetActiveDeice(void)
 @Description			TCFG_EEPROM_GetActiveDeice					: 读取ActiveDeice
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetActiveDevice(void)
{
	if (1 == FLASH_EEPROM_ReadByte(TCFG_ACTIVE_DEVICE_OFFSET)) {
		return 0;
	}
	else {
		return 1;
	}
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNbiotBootCnt(unsigned int val)
 @Description			TCFG_EEPROM_SetNbiotBootCnt					: 保存NbiotBootCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNbiotBootCnt(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_NBIOT_BOOTCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetNbiotBootCnt(void)
 @Description			TCFG_EEPROM_GetNbiotBootCnt					: 读取NbiotBootCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetNbiotBootCnt(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_NBIOT_BOOTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapSentCnt(unsigned int val)
 @Description			TCFG_EEPROM_SetCoapSentCnt					: 保存CoapSentCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapSentCnt(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_COAP_SENTCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCoapSentCnt(void)
 @Description			TCFG_EEPROM_GetCoapSentCnt					: 读取CoapSentCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCoapSentCnt(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_COAP_SENTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapRecvCnt(unsigned int val)
 @Description			TCFG_EEPROM_SetCoapRecvCnt					: 保存CoapRecvCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapRecvCnt(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_COAP_RECVCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCoapRecvCnt(void)
 @Description			TCFG_EEPROM_GetCoapRecvCnt					: 读取CoapRecvCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCoapRecvCnt(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_COAP_RECVCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMqttSNSentCnt(unsigned int val)
 @Description			TCFG_EEPROM_SetMqttSNSentCnt					: 保存MqttSNSentCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMqttSNSentCnt(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_MQTTSN_SENTCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetMqttSNSentCnt(void)
 @Description			TCFG_EEPROM_GetMqttSNSentCnt					: 读取MqttSNSentCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetMqttSNSentCnt(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_MQTTSN_SENTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMqttSNRecvCnt(unsigned int val)
 @Description			TCFG_EEPROM_SetMqttSNRecvCnt					: 保存MqttSNRecvCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMqttSNRecvCnt(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_MQTTSN_RECVCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetMqttSNRecvCnt(void)
 @Description			TCFG_EEPROM_GetMqttSNRecvCnt					: 读取MqttSNRecvCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetMqttSNRecvCnt(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_MQTTSN_RECVCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetDevBootCnt(unsigned short val)
 @Description			TCFG_EEPROM_SetDevBootCnt					: 保存DevBootCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetDevBootCnt(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_DEV_BOOTCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetDevBootCnt(void)
 @Description			TCFG_EEPROM_GetDevBootCnt					: 读取DevBootCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetDevBootCnt(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_DEV_BOOTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetEventTime(unsigned int val)
 @Description			TCFG_EEPROM_SetEventTime						: 保存EventTime
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetEventTime(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_EVENT_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetEventTime(void)
 @Description			TCFG_EEPROM_GetEventTime						: 读取EventTime
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetEventTime(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_EVENT_TIME_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBackgroundTemp(int16_t val)
 @Description			TCFG_EEPROM_SetBackgroundTemp					: 保存BackgroundTemp
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBackgroundTemp(int16_t val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_TEMP_BACKGROUND_OFFSET, val);
}

/**********************************************************************************************************
 @Function			int16_t TCFG_EEPROM_GetBackgroundTemp(void)
 @Description			TCFG_EEPROM_GetBackgroundTemp					: 读取BackgroundTemp
 @Input				void
 @Return				val
**********************************************************************************************************/
int16_t TCFG_EEPROM_GetBackgroundTemp(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_TEMP_BACKGROUND_OFFSET);
}

/**********************************************************************************************************
 @Function			bool TCFG_EEPROM_CheckInfoBurned(void)
 @Description			TCFG_EEPROM_CheckInfoBurned					: 检测生产商信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool TCFG_EEPROM_CheckInfoBurned(void)
{
	if ( (0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 0)) && \
		(0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 1)) && \
		(0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 2)) && \
		(0x00 == FLASH_EEPROM_ReadByte(TCFG_FACTORY_BRAND_SN_OFFSET + 3)) ) {
		return false;
	}
	else {
		return true;
	}
}

/**********************************************************************************************************
 @Function			bool TCFG_EEPROM_CheckNewSNorBrand(void)
 @Description			TCFG_EEPROM_CheckNewSNorBrand					: 检测新的设备号或厂牌信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool TCFG_EEPROM_CheckNewSNorBrand(void)
{
	bool ret = false;
	char vender[4];
	unsigned int Brand = 0;
	
	if (TCFG_EEPROM_CheckInfoBurned() != true) {								//厂牌空
		ret = true;
	}
	
	if (TCFG_EEPROM_Get_MAC_SN() != TCFG_EEPROM_GetSNfromBrandKey()) {			//设备号不同
		ret = true;
	}
	
	TCFG_EEPROM_GetVender(vender);
	Brand |= (vender[0] & 0x000000FF) << 3*8;
	Brand |= (vender[1] & 0x000000FF) << 2*8;
	Brand |= (vender[2] & 0x000000FF) << 1*8;
	Brand |= (vender[3] & 0x000000FF) << 0*8;
	if (Brand != TCFG_EEPROM_GetFactoryBrand()) {							//厂牌号不同
		ret = true;
	}
	
	return ret;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSNfromBrandKey(unsigned int val)
 @Description			TCFG_EEPROM_SetSNfromBrandKey					: 保存SNfromBrandKey
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSNfromBrandKey(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_BRAND_SN_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetSNfromBrandKey(void)
 @Description			TCFG_EEPROM_GetSNfromBrandKey					: 读取SNfromBrandKey
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetSNfromBrandKey(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_BRAND_SN_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetFactoryBrand(unsigned int val)
 @Description			TCFG_EEPROM_SetFactoryBrand					: 保存FactoryBrand
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetFactoryBrand(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_BRAND_SN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetFactoryBrand(void)
 @Description			TCFG_EEPROM_GetFactoryBrand					: 读取FactoryBrand
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetFactoryBrand(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_BRAND_SN_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_Set_MAC_SN(unsigned int subsn)
 @Description			TCFG_EEPROM_Set_MAC_SN						: 保存MAC SN
 @Input				sn
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_Set_MAC_SN(unsigned int sn)
{
	unsigned int subsn = 0;
	
