gdgly/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	subsn |= (sn & 0xFF000000) >> 3*8;
	subsn |= (sn & 0x00FF0000) >> 1*8;
	subsn |= (sn & 0x0000FF00) << 1*8;
	subsn |= (sn & 0x000000FF) << 3*8;
	
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_MAC_SN_OFFSET, subsn);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_Get_MAC_SN(void)
 @Description			TCFG_EEPROM_Get_MAC_SN						: 读取MAC SN
 @Input				void
 @Return				sn
**********************************************************************************************************/
unsigned int TCFG_EEPROM_Get_MAC_SN(void)
{
	unsigned int subsn = 0;
	unsigned int sn = 0;
	
	subsn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	sn |= (subsn & 0xFF000000) >> 3*8;
	sn |= (subsn & 0x00FF0000) >> 1*8;
	sn |= (subsn & 0x0000FF00) << 1*8;
	sn |= (subsn & 0x000000FF) << 3*8;
	
	return sn;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MAC_SN_String(void)
 @Description			TCFG_EEPROM_Get_MAC_SN_String					: 读取MAC SN字符串
 @Input				void
 @Return				sn_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MAC_SN_String(void)
{
	unsigned int subsn = 0;
	unsigned int sn = 0;
	
	subsn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	sn |= (subsn & 0xFF000000) >> 3*8;
	sn |= (subsn & 0x00FF0000) >> 1*8;
	sn |= (subsn & 0x0000FF00) << 1*8;
	sn |= (subsn & 0x000000FF) << 3*8;
	
	memset((void *)TCFG_SystemData.SubMacSN, 0x0, sizeof(TCFG_SystemData.SubMacSN));
	sprintf((char*)TCFG_SystemData.SubMacSN, "%08x", sn);
	
	return (char*)TCFG_SystemData.SubMacSN;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetVender(char* vender)
 @Description			TCFG_EEPROM_SetVender						: 保存vender
 @Input				&vender
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetVender(char* vender)
{
	FLASH_EEPROM_WriteBuffer(TCFG_FACTORY_VENDER_OFFSET, (unsigned char*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_GetVender(char* vender)
 @Description			TCFG_EEPROM_GetVender						: 读取vender
 @Input				&vender
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_GetVender(char* vender)
{
	FLASH_EEPROM_ReadBuffer(TCFG_FACTORY_VENDER_OFFSET, (unsigned char*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_Vender_String(void)
 @Description			TCFG_EEPROM_Get_Vender_String					: 读取vender字符串
 @Input				void
 @Return				vender_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_Vender_String(void)
{
	TCFG_EEPROM_GetVender((char *)&TCFG_SystemData.SubVender);
	
	return (char*)TCFG_SystemData.SubVender;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMagMode(uint8_t val)
 @Description			TCFG_EEPROM_SetMagMode						: 保存MagMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMagMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_MAG_MODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			uint8_t TCFG_EEPROM_GetMagMode(void)
 @Description			TCFG_EEPROM_GetMagMode						: 读取MagMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetMagMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_MAG_MODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNbiotHeart(uint8_t val)
 @Description			TCFG_EEPROM_SetNbiotHeart					: 保存NbiotHeart
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNbiotHeart(uint8_t val)
{
	if (val == 0) {
		val = 1;
	}
	else if (val > 4) {
		val = 4;
	}
	
	FLASH_EEPROM_WriteByte(TCFG_NB_HEART_OFFSET, val);
}

/**********************************************************************************************************
 @Function			uint8_t TCFG_EEPROM_GetNbiotHeart(void)
 @Description			TCFG_EEPROM_GetNbiotHeart					: 读取NbiotHeart
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetNbiotHeart(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_NB_HEART_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarRange(uint8_t val)
 @Description			TCFG_EEPROM_SetRadarRange					: 保存RadarRange
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarRange(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_RANGE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRadarRange(void)
 @Description			TCFG_EEPROM_GetRadarRange					: 读取RadarRange
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRadarRange(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_RANGE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCarInDelay(uint8_t val)
 @Description			TCFG_EEPROM_SetCarInDelay					: 保存CarInDelay
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCarInDelay(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_CARIN_DELAY_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCarInDelay(void)
 @Description			TCFG_EEPROM_GetCarInDelay					: 读取CarInDelay
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCarInDelay(void)
{
	unsigned char val;
	
	val = FLASH_EEPROM_ReadByte(TCFG_CARIN_DELAY_OFFSET);
	if (val < 8) {
		val = 8;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRFCmdCnt(uint8_t val)
 @Description			TCFG_EEPROM_SetRFCmdCnt						: 保存RFCmdCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRFCmdCnt(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RF_CMDCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRFCmdCnt(void)
 @Description			TCFG_EEPROM_GetRFCmdCnt						: 读取RFCmdCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRFCmdCnt(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RF_CMDCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBCmdCnt(uint8_t val)
 @Description			TCFG_EEPROM_SetNBCmdCnt						: 保存NBCmdCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBCmdCnt(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_NB_CMDCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetNBCmdCnt(void)
 @Description			TCFG_EEPROM_GetNBCmdCnt						: 读取NBCmdCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetNBCmdCnt(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_NB_CMDCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Device_BootCount(void)
 @Description			TCFG_Utility_Add_Device_BootCount				: Device重启次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Device_BootCount(void)
{
	TCFG_SystemData.DeviceBootCount = TCFG_EEPROM_GetDevBootCnt() + 1;
	TCFG_EEPROM_SetDevBootCnt(TCFG_SystemData.DeviceBootCount);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Device_BootCount(void)
 @Description			TCFG_Utility_Get_Device_BootCount				: Device重启次数获取
 @Input				void
 @Return				Device_BootCount
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Device_BootCount(void)
{
	return TCFG_SystemData.DeviceBootCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Nbiot_BootCount(void)
 @Description			TCFG_Utility_Add_Nbiot_BootCount				: NBIot重启次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Nbiot_BootCount(void)
{
	TCFG_SystemData.NBIotBootCount++;
	if (TCFG_SystemData.NBIotBootCount > (10 + TCFG_EEPROM_GetNbiotBootCnt())) {
		TCFG_EEPROM_SetNbiotBootCnt(TCFG_SystemData.NBIotBootCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_BootCount(void)
 @Description			TCFG_Utility_Get_Nbiot_BootCount				: NBIot重启次数获取
 @Input				void
 @Return				Nbiot_BootCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_BootCount(void)
{
	return TCFG_SystemData.NBIotBootCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Coap_SentCount(void)
 @Description			TCFG_Utility_Add_Coap_SentCount				: NBIot Coap发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Coap_SentCount(void)
{
	TCFG_SystemData.CoapSentCount++;
	if (TCFG_SystemData.CoapSentCount > (10 + TCFG_EEPROM_GetCoapSentCnt())) {
		TCFG_EEPROM_SetCoapSentCnt(TCFG_SystemData.CoapSentCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Coap_SentCount(void)
 @Description			TCFG_Utility_Get_Coap_SentCount				: NBIot Coap发送次数获取
 @Input				void
 @Return				Coap_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Coap_SentCount(void)
{
	return TCFG_SystemData.CoapSentCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Coap_RecvCount(void)
 @Description			TCFG_Utility_Add_Coap_RecvCount				: NBIot Coap接收次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Coap_RecvCount(void)
{
	TCFG_SystemData.CoapRecvCount++;
	if (TCFG_SystemData.CoapRecvCount > (10 + TCFG_EEPROM_GetCoapRecvCnt())) {
		TCFG_EEPROM_SetCoapRecvCnt(TCFG_SystemData.CoapRecvCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Coap_RecvCount(void)
 @Description			TCFG_Utility_Get_Coap_RecvCount				: NBIot Coap接收次数获取
 @Input				void
 @Return				Coap_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Coap_RecvCount(void)
{
	return TCFG_SystemData.CoapRecvCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_MqttSN_SentCount(void)
 @Description			TCFG_Utility_Add_MqttSN_SentCount				: NBIot MqttSN发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_MqttSN_SentCount(void)
{
	TCFG_SystemData.MqttSNSentCount++;
	if (TCFG_SystemData.MqttSNSentCount > (10 + TCFG_EEPROM_GetMqttSNSentCnt())) {
		TCFG_EEPROM_SetMqttSNSentCnt(TCFG_SystemData.MqttSNSentCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_MqttSN_SentCount(void)
 @Description			TCFG_Utility_Get_MqttSN_SentCount				: NBIot MqttSN发送次数获取
 @Input				void
 @Return				MqttSN_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_MqttSN_SentCount(void)
{
	return TCFG_SystemData.MqttSNSentCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_MqttSN_RecvCount(void)
 @Description			TCFG_Utility_Add_MqttSN_RecvCount				: NBIot MqttSN接收次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_MqttSN_RecvCount(void)
{
	TCFG_SystemData.MqttSNRecvCount++;
	if (TCFG_SystemData.MqttSNRecvCount > (10 + TCFG_EEPROM_GetMqttSNRecvCnt())) {
		TCFG_EEPROM_SetMqttSNRecvCnt(TCFG_SystemData.MqttSNRecvCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_MqttSN_RecvCount(void)
 @Description			TCFG_Utility_Get_MqttSN_RecvCount				: NBIot MqttSN接收次数获取
 @Input				void
 @Return				MqttSN_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_MqttSN_RecvCount(void)
{
	return TCFG_SystemData.MqttSNRecvCount;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Iccid_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Iccid_String			: 读取Nbiot Iccid字符串
 @Input				void
 @Return				Nbiot_Iccid
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Iccid_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.iccid;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.iccid;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imei_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imei_String				: 读取Nbiot Imei字符串
 @Input				void
 @Return				Nbiot_Iccid
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imei_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imei;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imei;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_Rssi_IntVal(void)
 @Description			TCFG_Utility_Get_Nbiot_Rssi_IntVal				: 读取Nbiot Rssi值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_Rssi_IntVal(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.rssi;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_Rssi_UnCharVal(void)
 @Description			TCFG_Utility_Get_Nbiot_Rssi_UnCharVal			: 读取Nbiot Rssi值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_Rssi_UnCharVal(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.rssi;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_WorkMode(void)
 @Description			TCFG_Utility_Get_Nbiot_WorkMode				: 读取Nbiot WorkMode值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_WorkMode(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.connectedstate;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.connectedstate;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioSignalpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioSignalpower			: 读取Nbiot RadioSignalpower值
 @Input				void
 @Return				RadioSignalpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioSignalpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.Signalpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.Signalpower;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioTotalpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTotalpower			: 读取Nbiot RadioTotalpower值
 @Input				void
 @Return				RadioTotalpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioTotalpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.Totalpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.Totalpower;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioTXpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXpower			: 读取Nbiot RadioTXpower值
 @Input				void
 @Return				RadioTXpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioTXpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.TXpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.TXpower;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioTXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXtime				: 读取Nbiot RadioTXtime值
 @Input				void
 @Return				RadioTXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioTXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.TXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.TXtime;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXtime				: 读取Nbiot RadioRXtime值
 @Input				void
 @Return				RadioRXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioCellID				: 读取Nbiot RadioCellID值
 @Input				void
 @Return				RadioCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.CellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.CellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioECL(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioECL				: 读取Nbiot RadioECL值
 @Input				void
 @Return				RadioECL
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioECL(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.ECL;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.ECL;
#endif
}

