gdgly/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioSNR(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioSNR				: 读取Nbiot RadioSNR值
 @Input				void
 @Return				RadioSNR
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioSNR(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.SNR;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioEARFCN(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioEARFCN				: 读取Nbiot RadioEARFCN值
 @Input				void
 @Return				RadioEARFCN
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioEARFCN(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.EARFCN;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.EARFCN;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioPCI(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioPCI				: 读取Nbiot RadioPCI值
 @Input				void
 @Return				RadioPCI
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioPCI(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.PCI;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.PCI;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioRSRQ(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioRSRQ				: 读取Nbiot RadioRSRQ值
 @Input				void
 @Return				RadioRSRQ
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioRSRQ(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RSRQ;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RSRQ;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellEarfcn(void)
 @Description			TCFG_Utility_Get_Nbiot_CellEarfcn				: 读取Nbiot CellEarfcn值
 @Input				void
 @Return				CellEarfcn
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellEarfcn(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.earfcn;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.earfcn;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellPhysicalCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_CellPhysicalCellID		: 读取Nbiot PhysicalCellCellID值
 @Input				void
 @Return				CellCellID
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellPhysicalCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.physicalcellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.physicalcellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellPrimaryCell(void)
 @Description			TCFG_Utility_Get_Nbiot_CellPrimaryCell			: 读取Nbiot PrimaryCellCell值
 @Input				void
 @Return				CellCell
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellPrimaryCell(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.primarycell;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.primarycell;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellRsrp(void)
 @Description			TCFG_Utility_Get_Nbiot_CellRsrp				: 读取Nbiot CellRsrp值
 @Input				void
 @Return				CellRsrp
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellRsrp(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rsrp;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rsrp;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellRsrq(void)
 @Description			TCFG_Utility_Get_Nbiot_CellRsrq				: 读取Nbiot CellRsrq值
 @Input				void
 @Return				CellRsrq
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellRsrq(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rsrq;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rsrq;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellCellrssi(void)
 @Description			TCFG_Utility_Get_Nbiot_CellCellrssi			: 读取Nbiot CellCellrssi值
 @Input				void
 @Return				CellCellrssi
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellCellrssi(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rssi;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellSnr(void)
 @Description			TCFG_Utility_Get_Nbiot_CellSnr				: 读取Nbiot CellSnr值
 @Input				void
 @Return				Nbiot_CellSnr
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellSnr(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac	: 读取Nbiot NetworkRegistStatusTac值
 @Input				void
 @Return				Nbiot_NetworkRegistStatusTac
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.tac;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID	: 读取Nbiot NetworkRegistStatusCellID值
 @Input				void
 @Return				Nbiot_NetworkRegistStatusCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.cellID;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_ModelVersion(void)
 @Description			TCFG_Utility_Get_Nbiot_ModelVersion			: 读取Nbiot ModelVersion值
 @Input				void
 @Return				Nbiot_ModelVersion
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_ModelVersion(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.modelversion;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.modelversion;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_SentCount(void)
 @Description			TCFG_Utility_Get_Nbiot_SentCount				: 读取Nbiot SentCount值
 @Input				void
 @Return				Nbiot_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_SentCount(void)
{
#if NETPROTOCAL == NETCOAP
	return TCFG_Utility_Get_Coap_SentCount();
#elif NETPROTOCAL == NETMQTTSN
	return TCFG_Utility_Get_MqttSN_SentCount();
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RecvCount(void)
 @Description			TCFG_Utility_Get_Nbiot_RecvCount				: 读取Nbiot RecvCount值
 @Input				void
 @Return				Nbiot_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RecvCount(void)
{
#if NETPROTOCAL == NETCOAP
	return TCFG_Utility_Get_Coap_RecvCount();
#elif NETPROTOCAL == NETMQTTSN
	return TCFG_Utility_Get_MqttSN_RecvCount();
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Device_Batt_ShortVal(void)
 @Description			TCFG_Utility_Get_Device_Batt_ShortVal			: 读取Device Batt值
 @Input				void
 @Return				Device_Batt
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Device_Batt_ShortVal(void)
{
	return VBAT_ADC_Read(1000);
}

/**********************************************************************************************************
 @Function			short TCFG_Utility_Get_Device_Temperature(void)
 @Description			TCFG_Utility_Get_Device_Temperature			: 读取Device Temperature值
 @Input				void
 @Return				Device_Temperature
**********************************************************************************************************/
short TCFG_Utility_Get_Device_Temperature(void)
{
	return TEMPERATURE_ADC_Read(1000);
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Build_Time_String(void)
 @Description			TCFG_Utility_Get_Build_Time_String				: 读取Build Time字符串
 @Input				void
 @Return				buildtime_string
**********************************************************************************************************/
char* TCFG_Utility_Get_Build_Time_String(void)
{
	char bulidData[12];
	
	memset(bulidData, 0x0, sizeof(bulidData));
	memset((void*)&TCFG_SystemData.BuildTime, 0, sizeof(TCFG_SystemData.BuildTime));
	
	memcpy(bulidData, __DATE__, 12);
	if (!memcmp(&bulidData[0], "Jan", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '1';
	}
	else	if (!memcmp(&bulidData[0], "Feb", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '2';
	}
	else if (!memcmp(&bulidData[0], "Mar", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '3';
	}
	else if(!memcmp(&bulidData[0], "Apr", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '4';
	}
	else if (!memcmp(&bulidData[0], "May", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '5';
	}
	else if (!memcmp(&bulidData[0], "Jun", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '6';
	}
	else if (!memcmp(&bulidData[0], "Jul", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '7';
	}
	else if (!memcmp(&bulidData[0], "Aug", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '8';
	}
	else if (!memcmp(&bulidData[0], "Sep", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '9';
	}
	else if (!memcmp(&bulidData[0], "Oct", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '0';
	}
	else if (!memcmp(&bulidData[0], "Nov", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '1';
	}
	else if (!memcmp(&bulidData[0], "Dec", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '2';
	}
	
	memcpy(TCFG_SystemData.BuildTime, &bulidData[7], 4);
	memcpy(&TCFG_SystemData.BuildTime[8], &bulidData[4], 2);
	TCFG_SystemData.BuildTime[4] = '-';
	TCFG_SystemData.BuildTime[7] = '-';
  	TCFG_SystemData.BuildTime[11] = '\0';
	
